{
  "page": "SKR's Resume",
  "name": "Sumit Kumar Rai",
  "location": "Lalitpur-14, Nepal",
  "linkedin": {
    "text": "sumit-sampang-rai",
    "url": "https://www.linkedin.com/in/sumit-sampang-rai"
  },
  "website": {
    "text": "https://sumit-sampang-rai.github.io/",
    "url": "https://sumit-sampang-rai.github.io/"
  },
  "about": "Sumit is a Sr. Data Engineer in CloudFactory, has an IT career of a total of 8 years, and experience in building an enterprise data warehouse, automating workflows, and tackling challenging architectural with scalability problems. He has worked for two years as Software Developer, four years as DevOps Engineer, and two years as Data Engineer. With this wide scope of experience, he meets the business objectives, has best practices for quality work, and can troubleshoot tough technical problems.",
  "work-experiences": [
    {
      "entity": "CloudFactory",
      "registrar": "Sprout Technology Services Pvt. Ltd.",
      "experiences": [
        {
          "titles": [
            {
              "title_name": "Senior Data Engineer",
              "start": "2022-07-01",
              "end": null,
              "location": "Kathmandu, Nepal"
            },
            {
              "title_name": "Data Engineer",
              "start": "2020-12-01",
              "end": "2022-06-30",
              "location": "Kathmandu, Nepal"
            }
          ],
          "responsibilities": [
            "Awarded recognition for working dedicatedly on different pieces of work in the data team and being a strong pillar for the team.",
            "Loaded the data sources into the enterprise data warehouse using ETL/ELT tools and scripts.",
            "Wrote transformations in DBT following the Kimball approach along with the documentation and testings. Also ensure the data is complete, accurate, and timely.",
            "Enforced documentation and testing in the team to achieve 80% above to meet the goal of the organization of having a true self-service BI platform.",
            "Introduced SQLfluff and automated strict implementation of linting our SQL queries in the DBT models.",
            "Built a CI pipeline from scratch in GitHub actions to have a quick feedback to the data model source contributors.",
            "Orchestrated data pipelines using Prefect that existed in EC2 so that we have centralized logging and proper visibility of the pipeline runs.",
            "Lead on moving all the data pipelines existing in Xplenty to Prefect orchestration. The data source would be S3 or APIs provided by the clients and the destination was the company's API.",
            "Created and managed the SnowFlake objects: databases(catalogs), schemas, tables, views, stages, snowpipes, masks, and tasks."
          ]
        },
        {
          "titles": [
            {
              "title_name": "Software Developer (DevOps)",
              "start": "2018-12-31",
              "end": "2020-11-30",
              "location": "Kathmandu, Nepal"
            },
            {
              "title_name": "Associate DevOps Engineer",
              "start": "2018-10-01",
              "end": "2018-11-30",
              "location": "Kathmandu, Nepal"
            }
          ],
          "responsibilities": [
            "Awarded recognition for showing dedication towards increasing the availability and stability of a critical communication microservice application.",
            "Reduced the startup time of the EC2 instances by replacing ansible scripts with the Hashicorp packer.",
            "Write optimized SQL queries to process big data and get ultimate results to make proper business decisions.",
            "Troubleshoot and resolve issues in dev, test, and production environments among many apps to support the ongoing platform development.",
            "Update and upgrade legacy infrastructure in order to continue business operations.",
            "Work collaboratively with software engineering teams to meet the Scrum sprint goals."
          ]
        },
        {
          "titles": [
            {
              "title_name": "Data Science Intern",
              "start": "2020-11-01",
              "end": "2020-11-30",
              "location": "Kathmandu, Nepal"
            }
          ],
          "responsibilities": [
            "Troubleshoot and resolve issues in dev, test and production environments among many apps to support the ongoing platform development.",
            "Monitoring the operation of the applications and also enhancing its performance.",
            "Work collaboratively with software engineering teams to meet the Scrum sprint goals.",
            "Write optimized SQL queries to process big data and get ultimate results to make proper business decisions.",
            "Help automate and streamline the operations and processes as well as build and maintain tools for deployment, monitoring and operations.",
            "Update and upgrade legacy infrastructure in order to avoid business operations."
          ]
        }
      ]
    },
    {
      "entity": "Islington College",
      "experiences": [
        {
          "titles": [
            {
              "title_name": "External Supervisor",
              "start": "2019-07-01",
              "end": null,
              "location": "Kathmandu, Nepal",
              "count": false
            }
          ],
          "responsibilities": [
            "Guide the students studying Bachelors to complete their Final Year Project (FYP) on time.",
            "Mentor the students and assist them when help is required.",
            "Focus them to project aims and objectives and sync when required.",
            "Finally mark their project works and their presentation in their viva."
          ]
        }
      ]
    },
    {
      "entity": "Leapfrog Technology",
      "registrar": "Leapfrog Technology Nepal Pvt. Ltd.",
      "experiences": [
        {
          "titles": [
            {
              "title_name": "Software Engineer, DevOps",
              "start": "2017-12-01",
              "end": "2018-09-30",
              "location": "Kathmandu, Nepal"
            },
            {
              "title_name": "Associate DevOps Engineer, System Administrator",
              "start": "2016-09-01",
              "end": "2017-12-31",
              "location": "Kathmandu, Nepal"
            }
          ],
          "responsibilities": [
            "Developed python and Ansible scripts to configure EC2 infrastructures.",
            "Constructed the Jenkins pipeline for automated deployments of the source code.",
            "Designed and structured the Amazon Web Services (AWS) resources with Auto Scaling and Elastic Load Balancers via CloudFormation; configure and troubleshoot them as well.",
            "Engineered, implemented, and monitored security measures for the protection of computer systems, networks, and information.",
            "Setup and configured pfSense firewall for the Intranet; configured traffic shaping for suitable working environments, VPN (OpenVPN), IPS (Snort), web filter (Squid), and more.",
            "Setup identity managers using both FreeIPA and Active Directory to centralize the identities of the employees.",
            "Responsible for looking after DNS records and SSL certificates for the clients’ accounts as well as the entities."
          ]
        }
      ]
    },
    {
      "entity": "Incessant Rain Animation Studios",
      "registrar": "Incessant Rain Animation Studios Pvt. Ltd.",
      "experiences": [
        {
          "titles": [
            {
              "title_name": "Software Developer",
              "start": "2014-12-01",
              "end": "2016-09-23",
              "location": "Kathmandu, Nepal"
            }
          ],
          "responsibilities": [
            "Designed, developed, tested, and maintained file pipeline for the animators. Animators from different departments download necessary files or upload files they have worked on.",
            "Researched render batch commands and co-operated with the .NET programmer team to build an automated render job handler.",
            "Developed remote services manager tool for the rendering department to ease their render jobs."
          ]
        }
      ]
    }
  ],
  "academic-qualifications": [
    {
      "entity": "London Metropolitan University",
      "educations": [
        {
          "studies": [
            {
              "study_name": "Masters of Science in IT & Applied Security",
              "start": "2019-09-22",
              "end": "2022-06-09",
              "location": "London, UK"
            },
            {
              "study_name": "Bachelors of Science (Hons) in Computer Networking and IT Security",
              "start": "2012-02-01",
              "end": "2014-01-31",
              "location": "London, UK"
            }
          ]
        }
      ]
    },
    {
      "entity": "Informatics Academy",
      "educations": [
        {
          "studies": [
            {
              "study_name": "International Diploma in Information and Communication Technology",
              "start": "2011-04-01",
              "end": "2011-12-31",
              "location": "Victoria Street, Singapore"
            }
          ]
        }
      ]
    }
  ],
  "skills": {
    "Data": {
      "confidence": 100,
      "sub_skills": [
        "DBT",
        "Kimball",
        "SnowFlake",
        "Fivetran",
        "Prefect",
        "Meltano",
        "Pipelinewise",
        "Stitch",
        "Snowpipe",
        "SQL",
        "MySQL",
        "PostgreSQL",
        "MongoDB"
      ]
    },
    "AWS": {
      "confidence": 100,
      "sub_skills": [
        "EC2",
        "RDS",
        "S3",
        "ECS",
        "ECR",
        "VPC",
        "Route53",
        "Lambda",
        "IAM",
        "ACM",
        "CloudWatch",
        "EFS",
        "Athena",
        "AutoScaling"
      ]
    },
    "DevOps": {
      "confidence": 100,
      "sub_skills": [
        "Linux",
        "SSH",
        "Docker",
        "Ansible",
        "Terraform",
        "Jenkins",
        "Github",
        "Github Actions",
        "CI/CD",
        "Kubernetes"
      ]
    },
    "Networking": {
      "confidence": 100,
      "sub_skills": ["TCP/IP", "IPv4", "IPv4 Subnetting", "DHCP"]
    },
    "Programming": {
      "confidence": 100,
      "sub_skills": ["Python", "OOP", "MVC", "REST API"]
    },
    "Agile": { "confidence": 100, "sub_skills": ["Jira", "Scrum", "Kanban"] }
  }
}
