{
  "page": "Sumit Kumar Rai's Resume",
  "name": "Sumit Kumar Rai",
  "location": "Lalitpur-14, Nepal",
  "linkedin": {
    "text": "linkedin.com/in/sumit-sampang-rai",
    "url": "https://www.linkedin.com/in/sumit-sampang-rai/"
  },
  "website": [
    {
      "text": "toptal.com/resume/sumit-rai",
      "url": "https://toptal.com/resume/sumit-rai/"
    },
    {
      "text": "sumit-sampang-rai.github.io",
      "url": "https://sumit-sampang-rai.github.io/"
    }
  ],
  "about": "Sumit is a senior data engineer specializing in building an enterprise data warehouse, automating workflows, and tackling challenging architectural scalability problems. He has eight years of experience in the IT industry working as a software developer, DevOps engineer, and data engineer. With this vast experience, Sumit meets the business objectives, follows best practices to deliver quality products, and troubleshoots challenging technical problems.",
  "work-experiences": [
    {
      "entity": "CloudFactory",
      "registrar": "Sprout Technology Services Pvt. Ltd.",
      "location": "Kathmandu, Nepal",
      "experiences": [
        {
          "title_name": "Senior Data Engineer",
          "start": "2020-12-01",
          "end": null,
          "responsibilities": [
            "Led the migration of all data pipelines existing in Xplenty to Prefect orchestration due to the lower return value compared to the cost spent.",
            "Recognized for working dedicatedly on different parts of the project and being the pillar of the data team.",
            "Implemented documentation and tests, improving the team's performance by 80% and meeting the organization's goals of building a self-service BI platform.",
            "Wrote transformations in dbt following the Kimball approach and ensured complete, accurate, and timely data.",
            "Built a CI pipeline from scratch in GitHub Actions to have quick feedback for data model source contributors.",
            "Implemented the SQL standard by introducing SQLFluff and automatically evaluating the quality of the SQL using GitHub Actions.",
            "Loaded the data sources into the enterprise data warehouse using ETL/ELT tools and scripts.",
            "Orchestrated data pipelines using Prefect that existed in EC2 to enable centralized logging and proper visibility of the pipeline runs.",
            "Created and managed the Snowflake objects, including databases, catalogs, schemas, tables, views, stages, Snowpipe, masks, and tasks."
          ]
        },
        {
          "title_name": "Software Engineer, DevOps",
          "start": "2018-10-01",
          "end": "2020-11-30",
          "responsibilities": [
            "Increased the availability and stability of a critical communication microservice application from 95% to 99% and was awarded for this effort.",
            "Reduced the startup time of EC2 Auto Scaling instances by 70% by replacing on-load executable Ansible scripts into HashiCorp packer.",
            "Wrote optimized SQL queries to process big data and get ultimate results to make proper business decisions.",
            "Troubleshot and resolved issues across many apps to support the ongoing platform development in development, test, and production environments.",
            "Monitored the application's operation and enhanced its performance.",
            "Updated and upgraded legacy infrastructure to support business operations.",
            "Collaborated with the software engineering teams to meet the Scrum sprint goals."
          ]
        }
      ]
    },
    {
      "entity": "Leapfrog Technology",
      "registrar": "Leapfrog Technology Nepal Pvt. Ltd.",
      "location": "Kathmandu, Nepal",
      "experiences": [
        {
          "title_name": "Software Engineer, DevOps",
          "start": "2016-09-01",
          "end": "2018-09-30",
          "responsibilities": [
            "Developed the Python and Ansible scripts to configure EC2 infrastructures.",
            "Constructed the Jenkins pipelines to deploy the source codes automatically.",
            "Designed and structured the AWS resources with Auto Scaling and Elastic Load Balancing via CloudFormation. Configured and troubleshot them.",
            "Set up and configured pfSense firewall for the intranet. Configured the traffic shaping for suitable working environments, VPN (OpenVPN), Snort IPS, and Squid web filter.",
            "Engineered, implemented, and monitored security measures to protect computer systems, networks, and information.",
            "Set up FreeIPA and Active Directory identity managers to centralize the employees' identities and manage access permissions in networks and servers."
          ]
        }
      ]
    },
    {
      "entity": "Incessant Rain Animation Studios",
      "registrar": "Incessant Rain Animation Studios Pvt. Ltd.",
      "location": "Kathmandu, Nepal",
      "experiences": [
        {
          "title_name": "Software Developer",
          "start": "2014-12-01",
          "end": "2016-09-23",
          "responsibilities": [
            "Designed, developed, tested, and maintained file pipelines for animators from different departments to enable them to download necessary files or upload files they worked on.",
            "Researched render batch commands and cooperated with the .NET programming team to build an automated render job handler.",
            "Developed a remote services manager tool for the rendering department to ease their render jobs."
          ]
        }
      ]
    }
  ],
  "academic-qualifications": [
    {
      "entity": "London Metropolitan University",
      "location": "London, UK",
      "educations": [
        {
          "studies": [
            {
              "study_name": "Masters of Science in IT & Applied Security",
              "start": "2019-09-22",
              "end": "2022-06-09"
            },
            {
              "study_name": "Bachelors of Science (Hons) in Computer Networking and IT Security",
              "start": "2012-02-01",
              "end": "2014-01-31"
            }
          ]
        }
      ]
    },
    {
      "entity": "Informatics Academy",
      "location": "Victoria Street, Singapore",
      "educations": [
        {
          "studies": [
            {
              "study_name": "International Diploma in Information and Communication Technology",
              "start": "2011-04-01",
              "end": "2011-12-31"
            }
          ]
        }
      ]
    }
  ],
  "skills": {
    "Data": {
      "confidence": 100,
      "sub_skills": [
        "Data Engineering",
        "Data Warehousing",
        "DBT",
        "Kimball",
        "SnowFlake",
        "Big Data",
        "Fivetran",
        "Prefect",
        "Meltano",
        "Pipelinewise",
        "Stitch",
        "Singer",
        "Snowpipe",
        "SQL",
        "MySQL",
        "PostgreSQL",
        "MongoDB",
        "Xplenty"
      ]
    },
    "Cloud": {
      "confidence": 100,
      "sub_skills": [
        "AWS EC2",
        "AWS RDS",
        "AWS S3",
        "AWS ECS",
        "AWS ECR",
        "AWS ELB",
        "AWS VPC",
        "AWS Route53",
        "AWS Lambda",
        "AWS IAM",
        "AWS ACM",
        "AWS CloudWatch",
        "AWS EFS",
        "AWS Athena",
        "AWS AutoScaling",
        "AWS Glue",
        "AWS Step Functions",
        "GoDaddy",
        "Google Data Studio",
        "Google Big Query"
      ]
    },
    "DevOps": {
      "confidence": 100,
      "sub_skills": [
        "Linux",
        "SSH",
        "Docker",
        "Ansible",
        "Hashicorp Terraform",
        "Jenkins",
        "Github",
        "Github Actions",
        "CI/CD",
        "NGINX",
        "Apache2",
        "Hashicorp Packer",
        "Kubernetes"
      ]
    },
    "Networking": {
      "confidence": 100,
      "sub_skills": [
        "TCP/IP",
        "IPv4",
        "IPv4 Subnetting",
        "DHCP",
        "pfSense",
        "OpenVPN",
        "Sophos Firewall"
      ]
    },
    "Programming": {
      "confidence": 100,
      "sub_skills": [
        "Python",
        "Regex",
        "OOP",
        "MVC",
        "REST API",
        "Bash",
        "Bash Script",
        "R",
        "Java",
        "HTML/CSS",
        "Rest API",
        "Laravel",
        "PHP"
      ]
    },
    "Libraries": {
      "confidence": 100,
      "sub_skills": [
        "Pandas",
        "Plotly",
        "Seaborn",
        "PyQt5"
      ]
    },
    "Agile": { "confidence": 100, "sub_skills": ["Jira", "Scrum", "Kanban"] }
  }
}
